code/app/Controllers/Home.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `correo`, `rol`, `contra`) VALUES ('Emi', 'Torres', 'emi@gmail.com', '0', '1234')
---
    public function insertarForm(){
        $mUsuarios = new mUsuarios();
        $usuarioNuevo = [
            "nombre" => $_POST['nombre'],
            "apellido" => $_POST['apellido'],
            "correo" => $_POST['correo'],
            "rol" => $_POST['rol'],
            "contra" => $_POST['contra']
        ];
        $mUsuarios->insert($usuarioNuevo);